PERSONAS = {
    'застенчивая': {
        'temperament': [
            'робкая',
            'смущающаяся',
            'нерешительная',
            'скромная'
        ],
    },
    'дерзкая': {
        'temperament': [
            'наглая',
            'вызывающая',
            'самоуверенная',
            'нахальная'
        ],
    },
    'доминирующая': {
        'temperament': [
            'властная',
            'повелительная',
            'контролирующая'
        ],
    },
    'невинная': {
        'temperament': [
            'чистосердечная', 'наивная', 'непорочная',
            'доверчивая', 'светлая', 'ангельская', 'бесхитростная',
            'трогательная', 'незапятнанная'
        ]
    },
    'кокетливая': {
        'temperament': [
            'игривая', 'лукавая', 'обольстительная',
            'хитрая', 'смешливая', 'ветреная', 'флиртующая',
            'соблазнительно-невинная', 'дразнящая'
        ]
    },
    'таинственная': {
        'temperament': [
            'загадочная', 'непостижимая', 'окутанная тайной', 'мистическая',
            'нечитаемая', 'завуалированная', 'призрачная'
        ]
    },
    'страстная': {
        'temperament': [
            'пылкая', 'огненная', 'необузданная', 'экстатичная',
            'чувственная', 'аппетитная', 'жаждущая', 'неистовая',
            'обжигающая', 'неутолимая'
        ]
    },
    'мечтательная': {
        'temperament': [
            'витающая в облаках', 'романтичная', 'задумчивая', 'поэтичная',
            'возвышенная', 'фантазирующая', 'отстранённая', 'сентиментальная'
        ]
    },
    'грациозная': {
        'temperament': [
            'изящная', 'утончённая',  'аристократичная',
            'воздушная', 'гибкая', 'элегантная'
        ]
    },
}

NAMES = {
    'female': [
        'Амарилла', 'Моргана', 'Изабелла', 'Кассандра', 'Далия',
        'Люсинда', 'Серафина', 'Беатрис', 'Офелия', 'Вивьен',
        'Лилит', 'Сальма', 'Морвен', 'Хелена', 'Мелания',
        'Вампира', 'Ламения', 'Нектра', 'Сибилла', 'Эсмеральда',
        'Флёр', 'Лисбет', 'Милетта', 'Элоиза', 'Жизель',
        'Клоринда', 'Бьянка', 'Люсиль', 'Розалинда', 'Эвелина',
        'Равенна', 'Ноктюрна', 'Калиопе', 'Медея',
        'Селина', 'Веспера', 'Оберона', 'Драксена', 'Мефира',
        'Зара', 'Ясмина', 'Леила', 'Анаис', 'Шанис',
        'Киара', 'Таис', 'Нириэль', 'Сариэль', 'Лираэль',
        'Азалия', 'Эстель', 'Миртана', 'Сафира', 'Луара',
        'Фрейлина', 'Альмерия', 'Талиссия', 'Валерия', 'Эриния',
        'Селеста', 'Нимерия', 'Иоланта', 'Зефира', 'Коринна',
        'Малисента', 'Этания', 'Лунара', 'Виолетта', 'Астрид',
        'Рианнон', 'Эльвира', 'Тессамира', 'Фаэлина', 'Сильвия',
        'Аурелия', 'Клементина', 'Лаванда', 'Мирэль', 'Сабина',
        'Эйлина', 'Фиона', 'Гвинет', 'Летисия', 'Амброзия',
        'Ксавьера', 'Ирис', 'Фелисия', 'Эмерина', 'Тиалис',
        'Рубелла', 'Аластра', 'Мелисса', 'Винетта', 'Зельфина',
        'Карисса', 'Эйра', 'Лумия', 'Талия', 'Сорана',
        'Верена', 'Мавелина', 'Дианта', 'Эсфирь', 'Лилиана'
    ],
    'male': [
        'Дарьен', 'Люциан', 'Себастьян', 'Винсент', 'Ремигиус',
        'Лоренцо', 'Валентино', 'Доминик', 'Рафаэль', 'Алессандро',
        'Малкадор', 'Волдемар', 'Саргон', 'Драксус', 'Мортис',
        'Ксавьер', 'Люцифер', 'Бельфегор', 'Азраэль', 'Мезрих',
        'Ричард', 'Годфри', 'Лотарио', 'Данджеро', 'Скайлар',
        'Зефир', 'Казимир', 'Феликс', 'Леонардо', 'Марцелло',
        'Аластар', 'Годрик', 'Торрен', 'Вальтер', 'Ксавьер',
        'Рейнар', 'Кайден', 'Зерес', 'Орион', 'Ксиландер',
        'Зуриэль', 'Касандор', 'Ксилот', 'Разиэль', 'Назерис',
        'Квинтас', 'Зартос', 'Ксимлион', 'Озирис', 'Сетхис'
    ]
}

TITLES = {
    'female': [
        "Чародейка", "Колдунья", "Волшебница",
        "Ведьма", "Волхвова",
        "Искусительница", "Соблазнительница",
        "Обольстительница", "Прелестница",
        "Чаровница", "Фаворитка",
        "Некромантка", "Демоница", "Суккуба",
        "Сирена", "Вампиресса", "Тёмная Владычица",
        "Шутница", "Кокетка",
        "Жрица", "Повелительница", "Хранительница",
        "Интриганка",
        "Заклинательница",
        "Манипуляторша",
        "Мистическая Леди",
        "Плутовка",
        "Танцовщица",
        "Леди",
        "Царица",
        "Арканистка",
        "Мистерица",
        "Госпожа",
        "Хозяйка",
        "Владычица",
    ],
    'male': [
        'Чародей', 'Колдун', 'Волшебник',
        'Маг', 'Волхв', 'Магистр', 'Вампир'
        'Искуситель', 'Соблазнитель', 'Обольститель',
        'Ловелас', 'Сердцеед', 'Покоритель',
        'Некромант', 'Демон', 'Инкуб', 'Лорд Тьмы',
    ]
}

SUB_TITLES = [
    "Шёлковых Оков",
    "Запретных Ласк",
    "Горячих Вздохов",
    "Страстного Шёпота",
    "Обжигающих Касаний",
    "Манящих Изгибов",
    "Сладких Грёз",
    "Роковых Поцелуев",
    "Порочных Намёков",
    "Пылающей Страсти",
    "Лунного Соблазна",
    "Звёздного Искушения",
    "Тёмных Желаний",
    "Вечного Вожделения",
    "Хрустальных Фантазий",
    "Пляшущих Чар",
    "Зачарованной Похоти",
    "Алого Экстаза",
    "Изумрудной Похоти",
    "Сапфировых Ласк",
    "Бархатной Похоти",
    "Аметистового Жара",
    "Неутолимой Страсти",
    "Мимолётной Слабости",
    "Запретного Вкуса",
    "Скрытого Влечения",
    "Сладкого Греха",
    "Тайных Вздохов",
    "Опасных Утех",
    "Недозволенных Наслаждений",
    "Танцующих Теней",
    "Случайного Обнажения",
    "Неловкого Соблазна",
    "Потерянного Белья",
    "Забытой Непристойности",
    "Полуночных Ласк",
    "Пьянящих Чар",
    "Томных Заклинаний",
    "Коварных Удовольствий",
    "Жгучих Влечений",
    "Безудержного Соблазна",
    "Грациозного Искры",
    "Обнажённой Магии",
    "Разгорячённых Фантазий",
    "Игривого Флирта",
    "Шёлковых Стоянов",
    "Медовой Похоти",
    "Каблучного Колдовства",
    "Теневых Откровений",
    "Простынных Игр",
    "Трепетных Губ",
    "Колышущихся Форм",
    "Коварной Улыбки",
    "Шепчущих Уст",
    "Глубоких Декольте",
    "Съехавших Бретелек",
    "Пьянящего Смеха",
    "Чулочных Ловушек",
    "Безбельевой Магии",
    "Кружевных Чар",
    "Недозволенных Вдохов",
    "Спелых Намёков",
    "Ночных Утех",
    "Тайных Грёз",
    "Оголённых Страстей",
    "Крайнего Экстаза",
    "Бёдерного Соблазна",
    "Приоткрытого Корсета",
    "Краеприличного Танца",
    "Подмигиваний Тьмы",
    "Глубокого Вздоха",
    "Трепетной Плоти",
    "Кружевных Похотей",
    "Жаждущих Взглядов",
    "Подвязочных Теней",
    "Шёлковых Желаний",
    "Жарких Объятий",
    "Тлеющей Страсти",
    "Манящих Шёпотов",
    "Пульсирующей Похоти",
    "Скользящих Ласк",
    "Неистовых Чувств",
    "Горящих Намёков",
    "Томных Изгибов",
    "Дразнящих Вздохов",
    "Запретных Улыбок",
    "Сладостных Му́к",
    "Искрящихся Чар",
    "Пьяных Фантазий",
    "Обнажённых Влечений",
    "Жгучих Поцелуев",
    "Соблазнительных Теней",
    "Экстатичных Шёпотов",
    "Похотливых Искр",
]
