PERSONAS = {
    'застенчивая': {
        'descriptors': [
            'робкая',
            'смущающаяся',
            'нерешительная',
            'скромная'
        ],
    },
    'дерзкая': {
        'descriptors': [
            'наглая',
            'вызывающая',
            'самоуверенная',
            'нахальная'
        ],
    },
    'доминирующая': {
        'descriptors': [
            'властная',
            'повелительная',
            'контролирующая'
        ],
    },
    'невинная': {
        'descriptors': [
            'чистосердечная', 'наивная', 'непорочная',
            'доверчивая', 'светлая', 'ангельская', 'бесхитростная',
            'трогательная', 'незапятнанная'
        ]
    },
    'кокетливая': {
        'descriptors': [
            'игривая', 'лукавая', 'обольстительная',
            'хитрая', 'смешливая', 'ветреная', 'флиртующая',
            'соблазнительно-невинная', 'дразнящая'
        ]
    },
    'таинственная': {
        'descriptors': [
            'загадочная', 'непостижимая', 'окутанная тайной', 'мистическая',
            'нечитаемая', 'завуалированная', 'призрачная'
        ]
    },
    'страстная': {
        'descriptors': [
            'пылкая', 'огненная', 'необузданная', 'экстатичная',
            'чувственная', 'аппетитная', 'жаждущая', 'неистовая',
            'обжигающая', 'неутолимая'
        ]
    },
    'мечтательная': {
        'descriptors': [
            'витающая в облаках', 'романтичная', 'задумчивая', 'поэтичная',
            'возвышенная', 'фантазирующая', 'отстранённая', 'сентиментальная'
        ]
    },
    'грациозная': {
        'descriptors': [
            'изящная', 'утончённая',  'аристократичная',
            'воздушная', 'гибкая', 'элегантная'
        ]
    },
}

NAMES = {
    'female': [
        'Амарилла', 'Моргана', 'Изабелла', 'Кассандра', 'Далия',
        'Люсинда', 'Серафина', 'Беатрис', 'Офелия', 'Вивьен',
        'Лилит', 'Сальма', 'Морвен', 'Хелена', 'Мелания',
        'Вампира', 'Ламения', 'Нектра', 'Сибилла', 'Эсмеральда',
        'Флёр', 'Лисбет', 'Милетта', 'Элоиза', 'Жизель',
        'Клоринда', 'Бьянка', 'Люсиль', 'Розалинда', 'Эвелина',
        'Равенна', 'Ноктюрна', 'Калиопе', 'Медея',
        'Селина', 'Веспера', 'Оберона', 'Драксена', 'Мефира',
        'Зара', 'Ясмина', 'Леила', 'Анаис', 'Шанис',
        'Киара', 'Таис', 'Нириэль', 'Сариэль', 'Лираэль'
    ],
    'male': [
        'Дарьен', 'Люциан', 'Себастьян', 'Винсент', 'Ремигиус',
        'Лоренцо', 'Валентино', 'Доминик', 'Рафаэль', 'Алессандро',
        'Малкадор', 'Волдемар', 'Саргон', 'Драксус', 'Мортис',
        'Ксавьер', 'Люцифер', 'Бельфегор', 'Азраэль', 'Мезрих',
        'Ричард', 'Годфри', 'Лотарио', 'Данджеро', 'Скайлар',
        'Зефир', 'Казимир', 'Феликс', 'Леонардо', 'Марцелло',
        'Аластар', 'Годрик', 'Торрен', 'Вальтер', 'Ксавьер',
        'Рейнар', 'Кайден', 'Зерес', 'Орион', 'Ксиландер',
        'Зуриэль', 'Касандор', 'Ксилот', 'Разиэль', 'Назерис',
        'Квинтас', 'Зартос', 'Ксимлион', 'Озирис', 'Сетхис'
    ]
}

TITLES = {
    'female': [
        "Чародейка", "Колдунья", "Волшебница",
        "Ведьма", "Волхвова",
        "Искусительница", "Соблазнительница",
        "Обольстительница", "Прелестница",
        "Чаровница", "Фаворитка",
        "Некромантка", "Демоница", "Суккуба",
        "Сирена", "Вампиресса", "Тёмная Владычица",
        "Шутница", "Кокетка",
        "Жрица", "Повелительница", "Хранительница",
        "Интриганка",
        "Заклинательница",
        "Манипуляторша",
        "Мистическая Леди",
        "Плутовка",
        "Танцовщица",
        "Леди",
        "Царица",
        "Арканистка",
        "Мистерица",
        "Госпожа",
        "Хозяйка",
        "Владычица",
    ],
    'male': [
        'Чародей', 'Колдун', 'Волшебник',
        'Маг', 'Волхв', 'Магистр', 'Вампир'
        'Искуситель', 'Соблазнитель', 'Обольститель',
        'Ловелас', 'Сердцеед', 'Покоритель',
        'Некромант', 'Демон', 'Инкуб', 'Лорд Тьмы',
    ]
}

SUB_TITLES = [
    'Шёлковых Оков', 'Запретных Ласк', 'Горячих Вздохов',
    'Страстного Шёпота', 'Нежных Мук',
    'Обжигающих Прикосновений', 'Манящих Изгибов',
    'Сладких Грёз', 'Роковых Поцелуев', 'Порочных Намёков',
    'Пылающего Феникса', 'Лунного Сияния', 'Звёздной Пыли',
    'Забытых Заклинаний', 'Вечного Пламени',
    'Хрустальных Видений', 'Пляшущих Огней', 'Зачарованной Луны',
    'Алого Заката', 'Изумрудного Леса', 'Сапфировых Волн',
    'Бархатной Ночи', 'Аметистового Дыма',
    'Вечной Страсти', 'Минутной Слабости', 'Запретного Знания',
    'Скрытого Желания', 'Сладкого Греха',
    'Невысказанных Мыслей', 'Опасных Игр',
    'Запрещённых Наслаждений', 'Танцующих Теней',
    'Случайного Разоблачения', 'Неловкого Момента',
    'Потерянного Нижнего Белья',
    'Забытой Непристойности',
    "Полуночных Прикосновений",
    "Пьянящих Намёков",
    "Томных Заклинаний",
    "Коварных Ласк",
    "Жгучих Желаний",
    "Соблазна Без Границ",
    "Грациозного Искушения",
    "Обнажённой Магии",
    "Разгорячённых Грез",
    "Игристого Флирта",
    "Магии Шёлковых Стонов",
    "Медовых Секретов",
    "Колдовства На Высоких Каблуках",
    "Откровений в Тени Платья",
    "Игр Под Простынёй",
    "Трепета На Краю Губ",
    "Колышущихся Форм",
    "Подозрительной Улыбки",
    "Шепчущих Губ",
    "Секретов Глубоких Декольте",
    "Случайно Съехавших Бретелек",
    "Пьянящего Смеха",
    "Ловушек Из Чулок",
    "Магии Без Нижнего Белья",
    "Волшебства Сквозь Кружево",
    "Вдохов Без Разрешения",
    "Спелых Намёков",
    "Ночных Ублажений",
    "Сладости Тайных Мечт",
    "Оголённых Намерений",
    "Заклинаний на Краю Экстаза",
    "Соблазна в Движении Бёдер",
    "Секретов Приоткрытого Корсета",
    "Танца На Грани Приличия",
    "Подмигиваний Сквозь Тьму",
    "Магии Глубокого Вздоха",
    "Вуали Трепетной Плоти",
    "Кружевных Соблазнов",
    "Желания в Каждом Взгляде",
    "Тени Под Подвязкой"
]
