OUTFIT_PARTS = {
    '1': [  # bottom_underwear
        "кружевные трусики", "трусики", "стринги",
    ],
    '2': [  # top_underwear
        "кружевной бюстгальтер", "шёлковый лифчик",
        "корсет с завязками", "облегающий боди",
    ],
    '3': [  # secondary_clothes
        "чёрные чулки", "сетчатые чулки", "длинные гольфы",
    ],
    '4': [  # primary_clothes
        "облегающее платье", "короткий сарафан", "прозрачная туника",
        "мини-юбка", "боди с вырезами", "платье", "облегающие брюки",
        "приталенное платье", "обтягивающий костюм", "тонкий пеньюар",
    ],
    '5': [  # outerwear
        "накидка", "плащ", "шёлковая мантия",
        "открытый жилет", "короткая накидка", "накидка",
        "накидка на плечи",
    ],
    '6': [  # accessories
        "браслет", "маска", "кулон", "кольцо", "лента в волосах",
        "шелковый пояс",
    ],
}
